//
// think.h
//
#pragma once

#include <tchar.h> // Unicode対応の _T() 関数を使用するために。


//--------------------------------------------------------------------------------
// #define まとめ
//--------------------------------------------------------------------------------

// 碁石
#define BLACK 1
#define WHITE 2
#define WAKU  3		// 盤外

#define BOARD_MAX ((19+2)*256)	// 19路盤を最大サイズとする
#define UNCOL(x) (3-(x))		// 石の色を反転させる


//--------------------------------------------------------------------------------
// enum まとめ
//--------------------------------------------------------------------------------

// 現在局面で何をするか、を指定
enum GameType {
	GAME_MOVE,				// 通常の手
	GAME_END_STATUS,		// 終局処理
	GAME_DRAW_FIGURE,		// 図形を描く
	GAME_DRAW_NUMBER 		// 数値を書く
};

// move()関数で手を進めた時の結果
enum MoveResult {
	MOVE_SUCCESS,			// 成功
	MOVE_SUICIDE,			// 自殺手
	MOVE_KOU,				// コウ
	MOVE_EXIST,				// 既に石が存在
	MOVE_FATAL				// それ以外
};


//--------------------------------------------------------------------------------
// 関数宣言まとめ
//--------------------------------------------------------------------------------

int		think_sample	(int col);

