//
// cgfthink.h
//

// #pragma once とは、
// いくつものソースファイル（～.c、～.cpp）から　このヘッダ・ファイルを
// 何回 #include しようとしても　２回目以降無視する呪文だぜ☆
#pragma once


//--------------------------------------------------------------------------------
// #define まとめ
//--------------------------------------------------------------------------------

// DLL_EXPORT は、あなたが今読んでいるこの .dll ファイルのソースコードとは別の、
// 実行中の .exe プログラムから、呼び出させたい関数の頭に付けるおまじないだぜ☆
#define DLL_EXPORT	__declspec( dllexport )


//--------------------------------------------------------------------------------
// 関数宣言まとめ（１）　別のアプリケーションから呼び出されるもの
//--------------------------------------------------------------------------------

// 思考ルーチン。本体から現在の手数とそれまでの棋譜が入った状態で呼ばれる。
// 手の座標を返す。PASSの場合0を。
// また、終局処理の場合は、終局判断の結果を返す。
DLL_EXPORT int cgfgui_thinking(
	int initBoard[],	// 初期盤面（置碁の場合は、ここに置石が入る）
	int kifu[][3],		// 棋譜  [][0]...座標、[][1]...石の色、[][2]...消費時間（秒)
	int tesuu,			// 手数
	int flgBlackTurn,	// 黒手番フラグ(黒番...1、白番...0)。ここだけ定数と違ってややこしい。
	int boardSize,		// 盤面のサイズ
	double komi,		// コミ
	int endgameType,	// 0...通常の思考、1...終局処理、2...図形を表示、3...数値を表示。
	int endgameBoard[]	// 終局処理の結果を代入する。
);

// 対局開始時に一度だけ呼ばれます。
DLL_EXPORT void cgfgui_thinking_init(int *pThinkStoped);

// 対局終了時に一度だけ呼ばれます。
DLL_EXPORT void cgfgui_thinking_close(void);


